contrib-imola/cics-bc/jbi4cics/src/test/resources/xmlmessages/testOccursMessage2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:it.imolinfo.jbi4cics.test.webservices.utils.generators" xmlns:gen="http://generators.utils.webservices.test.jbi4cics.imolinfo.it">
   <soapenv:Body>
      <urn:provaOccurs2Operation>
         <urn:in0>
            <!--Optional:-->
            <gen:DFHCOMMAREA>
               <!--Optional:-->
               <gen:CA_PROVA_OCCURS>
                  <!--Zero or more repetitions:-->
                  <gen:CA_PROVA_OCCURS>
                     <!--Optional:-->
                     <gen:CA_ROW1>8</gen:CA_ROW1>
                     <!--Optional:-->
                     <gen:CA_ROW2>aaa</gen:CA_ROW2>
                  </gen:CA_PROVA_OCCURS>
                  <gen:CA_PROVA_OCCURS>
                     <!--Optional:-->
                     <gen:CA_ROW1>9</gen:CA_ROW1>
                     <!--Optional:-->
                     <gen:CA_ROW2>bbb</gen:CA_ROW2>
                  </gen:CA_PROVA_OCCURS>
                  <gen:CA_PROVA_OCCURS>
                     <!--Optional:-->
                     <gen:CA_ROW1>10</gen:CA_ROW1>
                     <!--Optional:-->
                     <gen:CA_ROW2>ccc</gen:CA_ROW2>
                  </gen:CA_PROVA_OCCURS>
               </gen:CA_PROVA_OCCURS>
               <!--Optional:-->
               <gen:CA_RETCODE>1</gen:CA_RETCODE>
               <!--Optional:-->
               <gen:CA_SWSECI1_COMMAREA>
                  <!--Optional:-->
                  <gen:CA_CICS_ABSTIME>2</gen:CA_CICS_ABSTIME>
                  <!--Optional:-->
                  <gen:CA_CURRENT_DATE>ddd</gen:CA_CURRENT_DATE>
                  <!--Optional:-->
                  <gen:CA_CURRENT_TIME>ccc</gen:CA_CURRENT_TIME>
                  <!--Optional:-->
                  <gen:CA_ERROR_MESSAGE>fff</gen:CA_ERROR_MESSAGE>
                  <!--Optional:-->
                  <gen:CA_NUMBER_OF_ROWS>333</gen:CA_NUMBER_OF_ROWS>
                  <!--Optional:-->
                  <gen:CA_PROVA1>88</gen:CA_PROVA1>
                  <!--Optional:-->
                  <gen:CA_ROW_DATA>
                     <!--Zero or more repetitions:-->
                     <gen:CA_ROW_DATA>
                        <!--Optional:-->
                        <gen:CA_DATA>sss</gen:CA_DATA>
                        <!--Optional:-->
                        <gen:CA_ROW_NUMBER>1</gen:CA_ROW_NUMBER>
                        <!--Optional:-->
                        <gen:CA_ROW_NUM_AS_CHAR>aaa</gen:CA_ROW_NUM_AS_CHAR>
                     </gen:CA_ROW_DATA>
                     <gen:CA_ROW_DATA>
                        <!--Optional:-->
                        <gen:CA_DATA>zzz</gen:CA_DATA>
                        <!--Optional:-->
                        <gen:CA_ROW_NUMBER>2</gen:CA_ROW_NUMBER>
                        <!--Optional:-->
                        <gen:CA_ROW_NUM_AS_CHAR>ccc</gen:CA_ROW_NUM_AS_CHAR>
                     </gen:CA_ROW_DATA>
                     <gen:CA_ROW_DATA>
                        <!--Optional:-->
                        <gen:CA_DATA>xxx</gen:CA_DATA>
                        <!--Optional:-->
                        <gen:CA_ROW_NUMBER>3</gen:CA_ROW_NUMBER>
                        <!--Optional:-->
                        <gen:CA_ROW_NUM_AS_CHAR>ddd</gen:CA_ROW_NUM_AS_CHAR>
                     </gen:CA_ROW_DATA>
                  </gen:CA_ROW_DATA>
               </gen:CA_SWSECI1_COMMAREA>
            </gen:DFHCOMMAREA>
         </urn:in0>
      </urn:provaOccurs2Operation>
   </soapenv:Body>
</soapenv:Envelope>